#### SetAttribute Method (String, ISet(Int32))

---

|  |
| --- |
| IFCAnyHandle Class   See Also |

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void SetAttribute( 	string name, 	ISet<int> values ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetAttribute ( _ 	name As String, _ 	values As ISet(Of Integer) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetAttribute( 	String^ name,  	ISet<int>^ values ) ``` |

#### Parameters

name
:   Type:  System String

values
:   Type:  System.Collections.Generic ISet   Int32

# See Also

IFCAnyHandle Class

SetAttribute Overload

Autodesk.Revit.DB.IFC Namespace